<?php

namespace constants;

const REG_FOR_NAME     = '/^([a-zA-Z-а-яА-ЯёЁ]+\s)*[a-zA-Z-а-яА-ЯёЁ]+$/';
const REG_FOR_EMAIL = '/^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/';
const REG_FOR_SYMBOLS  = '/[_~!@#$%^&*()\[\]+`\'";:<>\/\\|=]/';
const REG_FOR_PASSWORD = '/^([0-9a-zA-Z-а-яА-ЯёЁ]+)*[0-9a-zA-Z-а-яА-ЯёЁ]+$/';

const errorMessages = [
  'email'=> 'Введите валидный email',
  'password'=> 'Пароль содержит не допустимые символы. Текст может состоять из цифр, латиницы, кириллицы, дефиса.',
  'name'=> 'Имя содержит недопустимые символы. Текст может состоять из латиницы, кириллицы, дефиса, пробела.',
];